---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.SplitSketchBasedElementFailures
source: html/fcae5f4b-d3e6-9dff-135c-903063429f8d.htm
---
# BuiltInFailures.SplitSketchBasedElementFailures Properties

The split failed. There may be a gap in the boundary loop or the sketch may be incomplete.